# Дано целое число в диапазоне 100–999. Вывести строку-описание данного числа, например: 256 — «двести пятьдесят шесть», 814 — «восемьсот четырнадцать».
def num_to_str(x: int):
    hundreds = [
        "сто",
        "двести",
        "триста",
        "четыреста",
        "пятьсот",
        "шестьсот",
        "семьсот",
        "восемьсот",
        "девятьсот",
    ]

    s = hundreds[x // 100 - 1]
    if (x % 100) == 0:
        return s
    x = x % 100
    if 10 <= x <= 19:
        tens2 = [
            "десять",
            "одинадцать",
            "двенадцать",
            "тринадцать",
            "четырнадцать",
            "пятнадцать",
            "шестнадцать",
            "семнадцать",
            "восемнадцать",
            "девятнадцать",
        ]
        s = s + " " + tens2[x - 10]
        return s
    if x > 19:
        tens = [
            "двадцать",
            "тридцать",
            "сорок",
            "пятьдесят",
            "шестьдесят",
            "семьдесят",
            "восемьдесят",
            "девяносто",
        ]
        s = s + " " + tens[x // 10 - 2]

    units = [
        "один",
        "два",
        "три",
        "четыре",
        "пять",
        "шесть",
        "семь",
        "восемь",
        "девять",
    ]

    remainder = x % 10
    if remainder == 0:
        return s
    s = s + " " + units[remainder - 1]
    return s


if __name__ == "__main__":
    try:
        x = int(input("Введите целое число  в диапазоне 100–999: "))
    except ValueError:
        print("Произошла ошибка ввода. Число берём 512")
        x = 512
    if not (100 <= x <= 999):
        print(
            "Число не в диапазоне. Поскольку не хочется запускать этот скрипт ещё раз, возьмём 512"
        )
        x = 512
    print("Преобразованное число - ", num_to_str(x))
